# Parameters Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
NavisworksExportOptions..::..Parameters Property
NavisworksExportOptions Class See Also
---
Options which specifies the parameter conversion of Navisworks Exporter. Default value is All.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public NavisworksParameters Parameters { get; set; }
```

Visual Basic
---
```text
Public Property Parameters As NavisworksParameters
	Get
	Set
```

Visual C++
---
```text
public:
property NavisworksParameters Parameters {
	NavisworksParameters get ();
	void set (NavisworksParameters value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
NavisworksExportOptions Class
Autodesk.Revit.DB Namespace